Repository: oscarahalvorsen/masterproject
Catalog: datacollecting/MAALFRID/tmx/kompetansenorge.no.csv-en-nn.deduped.tmx
Source language: en
Languages: nn

source: Regularly the tinsmith will:• set up a list of required tools and equipment for a mission
nn: Av og til vil Reindriftsutøvarenen• vurdere behov for arbeidskraft i forhold til sesong og

source: • read training material and tests
nn: Av og til vil transportarbeidaren

source: The reception element covers receiving, processing and understanding text and oral communication.
nn: Resepsjon Kjerneelementet resepsjon handlar om det å motta, bearbeide og forstå tekst og munnleg kommunikasjon.

source: • Sexual assault includes rape, touching and serious threats of a sexual
nn: • Seksuelle overgrep omfattar mellom anna valdtekt, beføling og

source: Test registration is binding.
nn: Påmeldinga til prøven er bindande.

source: • know how to transfer money and pay bills through online
nn: • kommunisere med arbeidsgivar og kundar digitalt

source: Production The production element is about oral and written expression in different contexts and for different purposes, and communicating messages intelligibly.
nn: Produksjon Kjerneelementet produksjon handlar om å uttrykke seg munnleg og skriftleg i ulike samanhengar og med ulike formål og å formidle bodskapar på ein forståeleg måte.

source: A sense of achievement creates positive and good learning experiences, but simply believing in one’s own abilities is not always enough.
nn: Å oppleva meistring skapar positive og gode læringsopplevingar, men berre det å tru på eigne evner er ikkje alltid nok.

source: • Play provides the foundations for learning and development.
nn: • Leiken dannar grunnlag for læring og utvikling.

source: • write and comment on personal posts and participate in discussions on
nn: • skrive og kommentere personlege innlegg og delta i diskusjonar om kjende

source: These objectives are considered goals on the way to level A1 in these skills.
nn: Desse måla blir rekna som delmål på veg til nivå A1 i desse ferdigheitene.

source: – payments from NAV if you lose your job.
nn: – utbetaling frå NAV viss ein mistar jobben

source: The topics and linguistic acts that will be focused on must be adapted to participants’ Norwegian language skills, their circumstances and their intended use of the Norwegian language in everyday life.
nn: Kva for tema og språkhandlingar det skal fokuserast på, må tilpassast norskferdigheitene til deltakarane, livssituasjonen deira og kva dei har behov for å bruke det norske språket til i kvardagen.

source: This makes correction work more rewarding for both the teacher and the learner.
nn: Då blir rettingsarbeidet meir motiverande for både læraren og innlæraren.

source: Production is also about being able to assess what different contexts require in terms of language and forms of communication, and employing strategies to meet these requirements.
nn: Produksjon omfattar også det å kunne vurdere kva krav ulike samanhengar stiller til språk og kommunikasjonsform, og å bruke strategiar for å møte desse krava.

source: • respond in writing to questionnaires
nn: • delta i formell opplæring og sertifisering

source: • write and respond in simple terms to messages, invitations, suggestions and
nn: • skrive og svare enkelt på meldingar, invitasjonar, forslag og gratulasjonar,

source: Some people have an agreement of five weeks of holiday and receive 12
nn: Somme har avtale om fem veker ferie, og får 12 % i feriepengar.

source: If you are entitled to one free test, but cannot take that test, you must pay for the next test.
nn: Dersom du har rett til éin gratis prøve, men ikkje kan ta prøven, må du betale for den neste prøven.

source: Georg has been working there on a regular basis since losing his job, but has not informed NAV.
nn: Georg jobbar der regelmessig no som han har blitt arbeidsledig, men han har ikkje meldt frå om dette til Nav.

source: • express their own opinions and discuss and comment on other people’s input
nn: • uttrykke eigne meiningar og diskutere og kommentere innspel frå andre i

source: • answer questions from parents and children
nn: • lese sjekklister for utførd arbeid

source: Smuggling narcotic substances is punishable by imprisonment for up to 21 years. Criminal
nn: Smugling av narkotiske stoff kan straffast med fengsel i inntil 21 år. Strafferamme for bruk og sal av narkotika

source: Despite little schooling, we see that they discuss both form and content, and develop a meta language for their own learning (Lindberg 2003).
nn: Trass i lite skulebakgrunn ser ein at dei diskuterer både form og innhald og utviklar eit metaspråk om eiga læring (Lindberg 2003).

source: Some test centres are closed due to the Covid-19 pandemic.
nn: Nokre prøvestader er stengde på grunn av covid-19.
